---
kind: method
id: M:Autodesk.Revit.DB.FamilyManager.CanElementParameterBeAssociated(Autodesk.Revit.DB.Parameter)
source: html/ee0cd1df-2342-9e91-cf57-d7eb9d240b90.htm
---
# Autodesk.Revit.DB.FamilyManager.CanElementParameterBeAssociated Method

Indicates if this element parameter can be associated with a family parameter.

## Syntax (C#)
```csharp
public bool CanElementParameterBeAssociated(
	Parameter elementParameter
)
```

## Parameters
- **elementParameter** (`Autodesk.Revit.DB.Parameter`)